<style scoped lang="less">
@import '~@/vant-variables.less';
.statement {
  padding: 20px;
  &__title {
    text-align: center;
  }
  &__content {
    font-size: 12px;
  }
  &--important {
    color: var(--v-error-darken1);
    font-weight: bold;
  }
  &--primary {
    font-size: 14px;
    color: var(--v-primary-base);
    font-weight: bold;
  }
  &--label {
    font-size: 14px;
    font-weight: bold;
  }
  &__button {
    margin-right: 10px;
    margin-top: 20px;
  }
}
</style>
<template style="overflow-y:hidden">
  <div>
    <div class="statement">
      <v-alert border="right" colored-border type="info" elevation="2">
        请您仔细参阅《文档类内容发布与下载须知》，本协议仅在您首次下载或发布文档时显示，您可在 <span class="statement--primary">设置-服务条款与声明</span> 中找到本协议。
      </v-alert>
      <p class="statement__title">《文档类内容发布与下载须知》</p>
      <div class="statement__content">
        <p>用户在此明确陈述并保证对所有上载、传播到OceanLib文库上的内容，拥有或取得了所有必要的权利并承担全部的法律责任，包括但不限于：用户有权或已取得必要的许可、授权、准许来使用所有与上传作品有关的所有专利、商标、商业秘密、版权、邻接权及其他私有权利。
          OceanLib文库没有权力来审查也没有能力审查用户上载、传播内容的权属问题，用户应自行解决有关权属问题，并保证不侵犯任何第三方合法权益。
        </p>
        <div class="statement--important">
          <p>禁止上传违反OceanLib文库相关规定的内容，包括但不限于如下：
          </p>
        </div>
        <p>1. 禁止发布、散布、宣扬、危害中国主权、攻击党和国家领导人、故意破坏社会稳定局势、邪教、反动、封建迷信、淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的。
        </p>
        <p>2. 禁止发布内容低级不健康、过分的性话题或太过隐私，不宜在公开场合讨论的话题；肮脏的、色情话题及黄色小段子；含病毒连接或恶意代码的。
        </p>
        <p>3. 禁止发布恐怖、凶杀以及给人视觉反感的图片、人体暴露照片、色情的以及打擦边球的图片（人体艺术图片视情况而定）。
        </p>
        <p>4. 禁止发布包含个人隐私内容的文档，比如：包含您或他人的电话号码、邮箱、住址等联系方式，以及个人身份证件号码、银行卡号，等等。
        </p>
        <p>5. 不得发表包含种族、肤色、性别、性取向、宗教、民族、地域、残疾、社会经济状况歧视内容的言论。
        </p>
        <p>6. 不得发表对他人构成伤害的言论，不得发表宣扬对青少年成长不利的言论；禁止进行人身攻击、侮辱或者诽谤他人、侵害他人合法权益的、含有法律、行政法规禁止的其他内容的；网络上传信息及其后果由上传者本人负责，违反各种法律法规及《保守国家秘密法》等严重行为者，将承担法律责任。 <span
            class="statement--important">涉密不上网，上网不涉密！</span></p>
        <p>7. 不得发表文档内容、简介、标题涉及广告宣传的。
        </p>
        <p>8. 不得发表盗版内容，非法转载以及侵权内容。OceanLib文库对他人在平台上实施的此类侵权行为不承担法律责任，侵权的法律责任概由本人承担。
        </p>
        <p>9.除上述外，用户不得违反下列限制或禁止：
        <p>（1）不得冒充任何人或机构，或以虚假不实的方式谎称或使人误认为与任何人或任何机构有关。<br />
          （2）不得伪造标题或以其他方式操控识别资料，使人误认为该内容为本平台所传送。<br />
          （3）不得将无权传送的内容（例如内部资料、机密资料）进行上载、张贴、发送电子邮件或以其他方式传送。<br />
          （4）不得将有关干扰、破坏或限制任何计算机软件、硬件或通讯设备功能的软件病毒或其他计算机代码、档案和程序之资料，加以上载、张贴、发送电子邮件或以其他方式传送，亦不得干扰或破坏本平台服务或与本平台服务相连的服务器和网络，或不遵守本平台使用之规定。
        </p>
        <p>
          11.用户对经由本平台上载、张贴、发送电子邮件或传送的内容承担全部责任对于经由本平台而传送的内容，本平台不保证前述其合法性、正当性、准确性、完整性或品质。用户在下载前应尽自身的预览义务，确认文档的真实性、准确性、有效性，一经下载，本平台不再进行退款。用户在接受本平台服务时，有可能会接触到令人不快、不适当或令人厌恶的内容。在任何情况下，本平台均不对任何内容承担任何责任，包括但不限于任何内容发生任何错误或纰漏以及衍生的任何损失或损害。本平台有权（但无义务）自行拒绝或删除经由本平台提供的任何内容。用户使用上述内容，应自行承担风险。本平台有权利在下述情况下，对内容进行保存或披露：
        </p>
        <p>（1）法律程序所规定；<br />
          （2）本服务条款的规定；<br />
          （3）被侵害的第三人提出权利主张；<br />
          （4）为保护本平台、其使用者及社会公众的权利、财产或人身安全。<br />
          （5）其他本平台认为有必要的情况。<br />
        </p>
        <p>12. 用户在OceanLib文库不得上传已存在的文档。
        </p>
        <p>13. 禁止上传无效或无价值文档。
        </p>
        <div class="statement--important">
          <p>如严重违反上述规定，OceanLib文库将对于违规用户会采取封闭账号、禁止访问的措施，并保留要求赔偿各种损失的权利。对于违反法律的行为将依规向学生所在高校相关部门进行反映，由此带来的严重后果本平台不承担责任！
          </p>
        </div>
        <p>用户在OceanLib文库上传文档，即代表用户已经阅读并同意OceanLib文库《服务条款》。如果用户不同意《服务条款》及上述规定之内容，切勿在OceanLib文库上传文档。
        </p>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  data() {
    return {};
  },
  mounted() {},
  methods: {},
};
</script>

<style>
</style>